Revit 2027 API
BuiltInFailures.DividedSurfaceFailures.DividedSurfaceCannotApplyDivideSettings Property
 Default Divide settings were not applied to Divided Surface. Please adjust grid spacing values manually.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId DividedSurfaceCannotApplyDivideSettings { get; }
Public Shared ReadOnly Property DividedSurfaceCannotApplyDivideSettings As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ DividedSurfaceCannotApplyDivideSettings {
	FailureDefinitionId^ get ();
}
static member DividedSurfaceCannotApplyDivideSettings : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.DividedSurfaceFailures Class
Autodesk.Revit.DB Namespace